EDT/УТ/src/Documents/Транспортировка/Транспортировка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Транспортировка</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЕО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ВозвратТоваровПоставщику</types>
      </type>
    </attributes>
    <attributes>
      <name>дмНомерЕдиницыОбработки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/ПараметрыИнтеграцииВозвратКомитенту/ПараметрыИнтеграцииВозвратКомитенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыИнтеграцииВозвратКомитенту</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>дмНомерЕдиницыОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>дмСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>дмНомерСозданногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>дмКомментарийКСтатусу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>дмGUIDСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>дмОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.Транспортировка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОперации</name>
    <type>
      <types>EnumRef.ТипыОперацийИнтеграцияДМПоВозвратам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Enums/ТипыОперацийИнтеграцияДМПоВозвратам/ТипыОперацийИнтеграцияДМПоВозвратам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОперацийИнтеграцияДМПоВозвратам</name>
  <enumValues>
    <name>ПроверкаСтатусаВозврата</name>
  </enumValues>
  <enumValues>
    <name>ПередачаДанныхОТранспортировке</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Documents/Транспортировка/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ДатаРейса = ТекущаяДата();
		Объект.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецеСли;	
	
	Если Параметры.СписокВозвратов.Количество() <> 0 Тогда
		СписокВозвратов = Параметры.СписокВозвратов;
		МассивВозвратов = СписокВозвратов.ВыгрузитьЗначения();
		Зап = Новый Запрос;
		Зап.Текст = "ВЫБРАТЬ
		            |	ВозвратТоваровПоставщику.Ссылка КАК Документ,
		            |	ПараметрыИнтеграцииВозвратКомитентуСрезПоследних.дмНомерЕдиницыОбработки КАК дмНомерЕдиницыОбработки,
		            |	ВозвратТоваровПоставщику.Контрагент КАК Контрагент
		            |ИЗ
		            |	Документ.ВозвратТоваровПоставщику КАК ВозвратТоваровПоставщику
		            |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыИнтеграцииВозвратКомитенту.СрезПоследних КАК ПараметрыИнтеграцииВозвратКомитентуСрезПоследних
		            |		ПО (ВозвратТоваровПоставщику.Ссылка = (ВЫРАЗИТЬ(ПараметрыИнтеграцииВозвратКомитентуСрезПоследних.Документ КАК Документ.ВозвратТоваровПоставщику)))
		            |			И (ПараметрыИнтеграцииВозвратКомитентуСрезПоследних.ТипОперации = ЗНАЧЕНИЕ(Перечисление.ТипыОперацийИнтеграцияДМПоВозвратам.ПроверкаСтатусаВозврата))
		            |ГДЕ
		            |	ВозвратТоваровПоставщику.Ссылка В(&МассивВозвратов)";
		Зап.УстановитьПараметр("МассивВозвратов", МассивВозвратов);
		
		Таб = Зап.Выполнить().Выгрузить();
		
		Объект.Документы.Загрузить(Таб);
		Объект.Контрагент = Таб[0].Контрагент;
		Объект.КоличествоЕО = Таб.Количество();
	КонецЕсли;
	
	
	ТолькоПросмотр = Объект.Проведен;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Если СписокВозвратов.Количество() <> 0 И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		ТекущийОбъект.ВыгрузитьТранспортировкуВДМ();
		МасДокументов = ТекущийОбъект.Документы.ВыгрузитьКолонку("Документ");
		РаботаСВозвратамиСервер.УстановитьСтатусОтправки(МасДокументов, Справочники.СтатусыСкладскогоУчета.ВозвратОтправлен);
	КонецеСли;	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	Если ВладелецФормы <> Неопределено Тогда
		ВладелецФормы.Элементы.Список.Обновить();
	КонецЕсли;	
КонецПроцедуры
